## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,4 +1,4 @@
-[command]/home/runner/work/_temp/a36d64c3-2ad3-4f35-b0fa-6f2d3d53d771/terraform-bin show -no-color tfplan-target
+[command]/home/runner/work/_temp/a36d64c3-2ad3-4f35-b0fa-6f2d3d53d771/terraform-bin show -no-color tfplan-pr
 
 Terraform used the selected providers to generate the following execution
 plan. Resource actions are indicated with the following symbols:
@@ -7,6 +7,29 @@ plan. Resource actions are indicated with the following symbols:
 
 Terraform will perform the following actions:
 
+  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = -1
+      + id                              = (known after apply)
+      + internet_ingestion_enabled      = false
+      + internet_query_enabled          = true
+      + local_authentication_disabled   = false
+      + location                        = "northeurope"
+      + name                            = "app-storage-test-law"
+      + primary_shared_key              = (sensitive value)
+      + resource_group_name             = "app-storage-test-resource-group"
+      + retention_in_days               = (known after apply)
+      + secondary_shared_key            = (sensitive value)
+      + sku                             = "PerGB2018"
+      + tags                            = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-storage-test"
+        }
+      + workspace_id                    = (known after apply)
+    }
+
   # module.resource_group.azurerm_resource_group.default[0] will be created
   + resource "azurerm_resource_group" "default" {
       + id       = (known after apply)
@@ -553,7 +576,7 @@ Terraform will perform the following actions:
         }
     }
 
-Plan: 21 to add, 0 to change, 0 to destroy.
+Plan: 22 to add, 0 to change, 0 to destroy.
 
 Changes to Outputs:
   + file_shares          = {
@@ -568,6 +591,6 @@ Changes to Outputs:
       + table1 = (known after apply)
     }
 ::debug::Terraform exited with code 0.
-::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.resource_group.azurerm_resource_group.default[0] will be created%0A  + resource "azurerm_resource_group" "default" {%0A      + id       = (known after apply)%0A      + location = "northeurope"%0A      + name     = "app-storage-test-resource-group"%0A      + tags     = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Managedby"     = "hello@clouddrove.com"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-resource-group"%0A        }%0A%0A      + timeouts {%0A          + create = "90m"%0A          + delete = "90m"%0A          + read   = "5m"%0A          + update = "90m"%0A        }%0A    }%0A%0A  # module.storage.data.azurerm_private_endpoint_connection.private-ip-0[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_private_endpoint_connection" "private-ip-0" {%0A      + id                         = (known after apply)%0A      + location                   = (known after apply)%0A      + name                       = "app-storage-test-storage87482-pe"%0A      + network_interface          = (known after apply)%0A      + private_service_connection = (known after apply)%0A      + resource_group_name        = "app-storage-test-resource-group"%0A    }%0A%0A  # module.storage.azurerm_advanced_threat_protection.atp[0] will be created%0A  + resource "azurerm_advanced_threat_protection" "atp" {%0A      + enabled            = true%0A      + id                 = (known after apply)%0A      + target_resource_id = (known after apply)%0A    }%0A%0A  # module.storage.azurerm_key_vault_key.kvkey[0] will be created%0A  + resource "azurerm_key_vault_key" "kvkey" {%0A      + curve                   = (known after apply)%0A      + e                       = (known after apply)%0A      + expiration_date         = "2034-10-22T18:29:59Z"%0A      + id                      = (known after apply)%0A      + key_opts                = [%0A          + "decrypt",%0A          + "encrypt",%0A          + "sign",%0A          + "unwrapKey",%0A          + "verify",%0A          + "wrapKey",%0A        ]%0A      + key_size                = 2048%0A      + key_type                = "RSA"%0A      + key_vault_id            = (known after apply)%0A      + n                       = (known after apply)%0A      + name                    = "app-storage-test-storage-key-vault-key"%0A      + public_key_openssh      = (known after apply)%0A      + public_key_pem          = (known after apply)%0A      + resource_id             = (known after apply)%0A      + resource_versionless_id = (known after apply)%0A      + tags                    = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"%0A        }%0A      + version                 = (known after apply)%0A      + versionless_id          = (known after apply)%0A      + x                       = (known after apply)%0A      + y                       = (known after apply)%0A    }%0A%0A  # module.storage.azurerm_private_dns_a_record.arecord[0] will be created%0A  + resource "azurerm_private_dns_a_record" "arecord" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = (known after apply)%0A      + records             = (known after apply)%0A      + resource_group_name = "app-storage-test-resource-group"%0A      + tags                = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"%0A        }%0A      + ttl                 = 3600%0A      + zone_name           = "privatelink.blob.core.windows.net"%0A    }%0A%0A  # module.storage.azurerm_private_dns_zone.dnszone[0] will be created%0A  + resource "azurerm_private_dns_zone" "dnszone" {%0A      + id                                                    = (known after apply)%0A      + max_number_of_record_sets                             = (known after apply)%0A      + max_number_of_virtual_network_links                   = (known after apply)%0A      + max_number_of_virtual_network_links_with_registration = (known after apply)%0A      + name                                                  = "privatelink.blob.core.windows.net"%0A      + number_of_record_sets                                 = (known after apply)%0A      + resource_group_name                                   = "app-storage-test-resource-group"%0A      + tags                                                  = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"%0A        }%0A%0A      + soa_record (known after apply)%0A    }%0A%0A  # module.storage.azurerm_private_dns_zone_virtual_network_link.vent-link[0] will be created%0A  + resource "azurerm_private_dns_zone_virtual_network_link" "vent-link" {%0A      + id                    = (known after apply)%0A      + name                  = "app-storage-test-pdz-vnet-link-storage"%0A      + private_dns_zone_name = "privatelink.blob.core.windows.net"%0A      + registration_enabled  = false%0A      + resource_group_name   = "app-storage-test-resource-group"%0A      + tags                  = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"%0A        }%0A      + virtual_network_id    = (known after apply)%0A    }%0A%0A  # module.storage.azurerm_private_endpoint.pep[0] will be created%0A  + resource "azurerm_private_endpoint" "pep" {%0A      + custom_dns_configs       = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "northeurope"%0A      + name                     = "app-storage-test-storage87482-pe"%0A      + network_interface        = (known after apply)%0A      + private_dns_zone_configs = (known after apply)%0A      + resource_group_name      = "app-storage-test-resource-group"%0A      + subnet_id                = (known after apply)%0A      + tags                     = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-storage-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"%0A        }%0A%0A      + private_service_connection {%0A          + is_manual_connection           = false%0A          + name                           = "app-storage-test-storage87482-psc"%0A          + private_connection_resource_id = (known after apply)%0A          + private_ip_address             = (known after apply)%0A          + subresource_names              = [%0A              + "blob",%0A            ]%0A        }%0A    }%0A%0A  # module.storage.azurerm_role_assignment.identity_assigned[0] will be created%0A  + resource "azurerm_role_assignment" "identity_assigned" {%0A      + condition_version                = (known after apply)%0A      + id                               = (known after apply)%0A   
```
See the full diff from https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14780276079

</details>

[GitHub Actions](https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14780276079)

<!-- diff-action -->
<!-- diff-action/.github/workflows/diff.yaml/terraform-plan-diff -->